Autodesk.Revit.DB.RevisionNumbering
Since:
2015
The options for how revision numbers should be displayed on sheets within a project.
Since:
2015

Autodesk.Revit.DB.RevisionNumbering.PerSheet
The revisions on a given sheet will be automatically assigned a consecutive sequence for their revision numbers displayed on that sheet.

Autodesk.Revit.DB.RevisionNumbering.PerProject
The revision numbers on a sheet will match the global Revision Sequence Number assigned to the revision.